{
    "Breakfast": [
      {
        "ingredients": [
          "1 cup sifted powdered sugar",
          "3/4 cup smooth old-fashioned peanut butter",
          "2 1/2 teaspoons vanilla extract",
          "2 tablespoons Grape-Nuts cereal",
          "2 1/2 cups whole milk",
          "4 large egg yolks",
          "3/4 cup sugar",
          "1/4 cup all purpose flour",
          "1/4 cup cornstarch",
          "6 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
          "1 9-inch-diameter frozen pie shell, baked according to package directions, cooled completely",
          "2 ripe bananas, peeled, sliced",
          "1 1/2 cups chilled whipping cream, beaten to firm peaks"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "../../images/B2.jpg",
        "instructions": "Using fork, mix powdered sugar, peanut butter and 1 teaspoon vanilla extract in medium bowl until mixture resembles coarse dry crumbs. Place cereal in small bowl. Mix 1/2 cup peanut butter mixture into cereal; set aside. Whisk 1/4 cup milk, yolks, sugar, flour and cornstarch in bowl to blend. Pour remaining 2 1/4 cups milk into heavy medium saucepan; bring to simmer. Gradually whisk hot milk into yolk mixture. Return mixture to saucepan. Whisk constantly over medium heat until custard boils and thickens, about 2 minutes. Remove from heat. Add white chocolate and remaining 1 1/2 teaspoons vanilla; whisk until chocolate melts. Cool completely. Sprinkle 1/2 cup plain (no cereal) peanut butter mixture over bottom of pie shell. Spoon half of custard filling over. Top with bananas, then remaining plain peanut butter mixture. Spoon remaining custard filling over, mounding in center. Refrigerate pie until cold, about 3 hours. (Can be made 6 hours ahead. Keep chilled.) Top with whipped cream and sprinkle with peanut butter-cereal mixture. Cut into wedges and serve.\nUsing fork, mix powdered sugar, peanut butter and 1 teaspoon vanilla extract in medium bowl until mixture resembles coarse dry crumbs. Place cereal in small bowl. Mix 1/2 cup peanut butter mixture into cereal; set aside.\nWhisk 1/4 cup milk, yolks, sugar, flour and cornstarch in bowl to blend. Pour remaining 2 1/4 cups milk into heavy medium saucepan; bring to simmer. Gradually whisk hot milk into yolk mixture. Return mixture to saucepan. Whisk constantly over medium heat until custard boils and thickens, about 2 minutes. Remove from heat. Add white chocolate and remaining 1 1/2 teaspoons vanilla; whisk until chocolate melts. Cool completely.\nSprinkle 1/2 cup plain (no cereal) peanut butter mixture over bottom of pie shell. Spoon half of custard filling over. Top with bananas, then remaining plain peanut butter mixture. Spoon remaining custard filling over, mounding in center. Refrigerate pie until cold, about 3 hours. (Can be made 6 hours ahead. Keep chilled.) Top with whipped cream and sprinkle with peanut butter-cereal mixture. Cut into wedges and serve.",
        "title": "Peanut Butter and White Chocolate Cream Pie "
      },
      {
        "ingredients": [
          "3 plum tomatoes, diced",
          "2 scallions, trimmed, thinly sliced",
          "1 jalapeño, finely chopped",
          "1 cup fresh corn kernels (from about 2 cobs)",
          "4 tablespoons fresh lime juice (from about 2 limes)",
          "Kosher salt",
          "3 avocados, sliced",
          "6 slices crusty white bread (such as country bread), toasted"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "./images/B2.jpg",
        "instructions": "Combine tomatoes, scallions, jalapeño, corn, and lime juice in a medium bowl. Season with salt. Using a fork, gently smash avocado slices evenly onto each toast. Top each generously with tomato-corn salsa.\nCombine tomatoes, scallions, jalapeño, corn, and lime juice in a medium bowl. Season with salt. Using a fork, gently smash avocado slices evenly onto each toast. Top each generously with tomato-corn salsa.",
        "title": "Avocado Toast with Tomato-Corn Salsa "
      },
      {
        "ingredients": [
          "Olive oil",
          "Spices (we're suckers for za'atar).",
          "2 cups plain whole-milk or 2% Greek yogurt",
          "1/2 teaspoon kosher salt",
          "Cheesecloth"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Mix 2 cups plain whole-milk or 2% Greek yogurt and 1/2 teaspoon kosher salt in a small bowl. Line a fine-mesh sieve with 2 layers of cheesecloth and set over a medium bowl. Place yogurt mixture in sieve, cover with plastic wrap, and let drain in refrigerator at least 1 day and up to 2, if you want it slightly thicker. Discard excess liquid.\nMix 2 cups plain whole-milk or 2% Greek yogurt and 1/2 teaspoon kosher salt in a small bowl. Line a fine-mesh sieve with 2 layers of cheesecloth and set over a medium bowl.\nPlace yogurt mixture in sieve, cover with plastic wrap, and let drain in refrigerator at least 1 day and up to 2, if you want it slightly thicker. Discard excess liquid.",
        "title": "Labneh "
      },
      {
        "ingredients": [
          "1/2 cup chopped mango",
          "1/2 cup chopped pineapple",
          "1/2 cup nonfat high-protein plain Greek yogurt or kefir",
          "4 mint leaves, torn into pieces"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Place all the ingredients and 3 ice cubes in a blender and blend on high speed for about 60 seconds or until smooth.\nPlace all the ingredients and 3 ice cubes in a blender and blend on high speed for about 60 seconds or until smooth.\nPour into a chilled glass and enjoy.\nPour into a chilled glass and enjoy.",
        "title": "Mango, Mint, and Pineapple Smoothie "
      },
      {
        "ingredients": [
          "1 small garlic clove",
          "1/4 cup fresh coriander",
          "3 tablespoons fresh lemon juice",
          "1/2 teaspoon sugar",
          "1/4 teaspoon salt",
          "1/2 cup olive oil",
          "a 14-ounce can hearts of palm, drained",
          "4 California firm-ripe avocados",
          "1 small red onion, sliced thin",
          "Boston lettuce leaves (from about 2 heads)"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Make vinaigrette: In a blender purée garlic and coriander with lemon juice, sugar, and salt. With motor running add oil in a stream, blending until dressing is emulsified.\nIn a blender purée garlic and coriander with lemon juice, sugar, and salt. With motor running add oil in a stream, blending until dressing is emulsified.\nMake salad: Cut hearts of palm and avocado into 3/4-inch cubes and in a large bowl with a rubber spatula gently toss with onion and vinaigrette until combined well.\nCut hearts of palm and avocado into 3/4-inch cubes and in a large bowl with a rubber spatula gently toss with onion and vinaigrette until combined well.\nLine 8 salad plates with lettuce leaves and mound avocado mixture on top.\nLine 8 salad plates with lettuce leaves and mound avocado mixture on top.",
        "title": "Avocado, Hearts of Palm, and Red Onion Salad with Coriander Vinaigrette "
      },
      {
        "ingredients": [
          "1 (15-ounce) can black-eyed peas, rinsed and drained",
          "1 cup chopped chopped cooked ham (5 ounces)",
          "1 celery rib, chopped",
          "1/2 cup chopped red onion",
          "1 small garlic clove, chopped",
          "1 teaspoon finely chopped fresh jalapeño",
          "2 1/2 tablespoons red-wine vinegar",
          "2 tablespoons vegetable oil",
          "1/4 cup chopped flat-leaf parsley"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Stir together all ingredients and season with salt and pepper. Let stand at room temperature 1 hour before serving.\nStir together all ingredients and season with salt and pepper. Let stand at room temperature 1 hour before serving.",
        "title": "Black-Eyed Pea and Ham Salad "
      },
      {
        "ingredients": [
          "Master Sweet Dough",
          "3 tablespoons extra-virgin olive oil, divided",
          "2 cups drained pitted tart cherries in light syrup (such as Morello) plus 1 cup syrup (from a 24-28-oz. jar)",
          "3 tablespoons granulated sugar",
          "3/4 cup sliced almonds (with or without skins)",
          "1/3 cup raw sugar",
          "Ingredient info: Tart cherries in light syrup can be found at some supermarkets and at Middle Eastern markets and sahadis.com."
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Punch down dough. Coat a large rimmed baking sheet (about 16x12\") with 1 tablespoon oil. Press dough evenly into pan, leaving a 1 1/2\" border. Loosely cover with plastic wrap or a kitchen towel; let rise in a warm, draft-free area until puffed but not doubled in size, 45-50 minutes. Meanwhile, bring cherry syrup and granulated sugar to a boil in a small saucepan, stirring to dissolve sugar. Reduce heat to medium; simmer, stirring occasionally, until mixture is reduced to 1/3 cup, 8-10 minutes. Transfer to a small bowl; let cool completely. Arrange a rack in middle of oven and preheat to 400°F. Using your fingertips, press dimples all over dough surface. Drizzle dough with remaining 2 tablespoons oil. Scatter cherries over, pressing them gently into dough. Drizzle reduced syrup over, allowing it to pool into nooks and crannies. Sprinkle almonds over, then raw sugar. Let rise until dough is doubled in size, 15-20 minutes. Bake until focaccia is golden brown, 20-23 minutes. Let cool in pan on a wire rack for at least 15 minutes. Serve warm or at room temperature.\nPunch down dough. Coat a large rimmed baking sheet (about 16x12\") with 1 tablespoon oil. Press dough evenly into pan, leaving a 1 1/2\" border. Loosely cover with plastic wrap or a kitchen towel; let rise in a warm, draft-free area until puffed but not doubled in size, 45-50 minutes.\nMeanwhile, bring cherry syrup and granulated sugar to a boil in a small saucepan, stirring to dissolve sugar. Reduce heat to medium; simmer, stirring occasionally, until mixture is reduced to 1/3 cup, 8-10 minutes. Transfer to a small bowl; let cool completely.\nArrange a rack in middle of oven and preheat to 400°F. Using your fingertips, press dimples all over dough surface. Drizzle dough with remaining 2 tablespoons oil. Scatter cherries over, pressing them gently into dough. Drizzle reduced syrup over, allowing it to pool into nooks and crannies. Sprinkle almonds over, then raw sugar. Let rise until dough is doubled in size, 15-20 minutes.\nBake until focaccia is golden brown, 20-23 minutes. Let cool in pan on a wire rack for at least 15 minutes. Serve warm or at room temperature.",
        "title": "Cherry-Almond Focaccia "
      },
      {
        "ingredients": [
          "1 cup water",
          "3 tablespoons vegetable oil",
          "1 tablespoon lightly beaten egg white",
          "1/4 teaspoon almond extract",
          "1 cup all-purpose flour",
          "2/3 cup confectioners sugar",
          "2 tablespoons finely ground blanched almonds",
          "6 tablespoons powdered milk",
          "Special equipment: an electric pizzella maker, 2 large (3 1/2-inch) ramekins, and 2 small (2 1/2-inch) ramekins"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Blend all ingredients in a blender at low speed until totally smooth, about 1 minute. Chill batter, covered, 1 hour. Heat pizzella maker and lightly brush top and bottom with oil. Pour a generous tablespoon batter on each side (left and right) of pizzella maker and spread quickly with back of a spoon to cover molds. Close cover and cook until golden, about 1 1/2 minutes. Working quickly (pizzella is pliable only while still hot), peel off 1 pizzella and fit into 1 large ramekin, then press a small ramekin inside to shape pizzella. Shape second pizzella using second pair of ramekins. Remove ramekins when waffle cups are hardened, about 2 minutes. Make more waffle cups with remaining batter.\nBlend all ingredients in a blender at low speed until totally smooth, about 1 minute. Chill batter, covered, 1 hour.\nHeat pizzella maker and lightly brush top and bottom with oil. Pour a generous tablespoon batter on each side (left and right) of pizzella maker and spread quickly with back of a spoon to cover molds. Close cover and cook until golden, about 1 1/2 minutes.\nWorking quickly (pizzella is pliable only while still hot), peel off 1 pizzella and fit into 1 large ramekin, then press a small ramekin inside to shape pizzella. Shape second pizzella using second pair of ramekins. Remove ramekins when waffle cups are hardened, about 2 minutes. Make more waffle cups with remaining batter.",
        "title": "Waffle Cups "
      },
      {
        "ingredients": [
          "1/2 cup extra-virgin olive oil",
          "1/4 cup fresh lemon juice",
          "1 shallot, minced",
          "1/2 teaspoon (packed) grated lemon peel",
          "1 large fresh fennel bulb, trimmed, halved, very thinly sliced",
          "1 8-ounce Fuji apple, halved, cored, cut into matchstick-size strips",
          "6 cups trimmed arugula leaves (from two 4-ounce packages)",
          "2 mandarin oranges or tangerines, peeled, each cut crosswise into 3 slices",
          "Pomegranate seeds"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Whisk first 4 ingredients in small bowl. Season dressing with salt and pepper. Combine fennel and apple in medium bowl; mix in 3 tablespoons dressing. Place arugula in large bowl. Add fennel-apple mixture. Toss, adding more dressing to taste. Divide salad among 6 plates. Garnish each with 1 mandarin orange slice and sprinkle with pomegranate seeds.\nWhisk first 4 ingredients in small bowl. Season dressing with salt and pepper. Combine fennel and apple in medium bowl; mix in 3 tablespoons dressing.\nPlace arugula in large bowl. Add fennel-apple mixture. Toss, adding more dressing to taste. Divide salad among 6 plates. Garnish each with 1 mandarin orange slice and sprinkle with pomegranate seeds.",
        "title": "Arugula, Fennel, Apple, Mandarin Orange, and Pomegranate Salad "
      },
      {
        "ingredients": [
          "2 cups buttermilk",
          "1 cup all-purpose flour",
          "1 egg",
          "1 teaspoon baking soda",
          "1/2 teaspoon salt"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Mix all ingredients well in small mixing bowl. Pour by spoonfuls onto hot, oiled griddle. Spread batter to make thin, crepe-like pancake. Cook until batter is bubbly. Turn over. Serve immediately with butter and syrup or favorite fruit sauce.",
        "title": "Buttermilk Pancakes"
      },
      {
        "ingredients": [
          "3 large eggs",
          "Pinch salt",
          "Freshly ground black pepper"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Break eggs into a small bowl; season with salt and pepper. Using a fork, beat no more than 30 strokes so only a minimal amount of foam develops. (Overbeating reduces the eggs' volume, resulting in a \"skinny\" omelet. The keys to success are speed and heat: Beating the eggs quickly and cooking them over high heat produces large, coagulated curds, resulting in a fluffy, soft omelet.)\nMelt butter in an 8-inch nonstick skillet over medium heat until butter begins to sizzle. Raise the heat to high, and add the beaten eggs. Count to five, then raise the pan so it forms a 45-degree angle to the burner. Rapidly shake the pan back and forth so the egg mixture is thrown against the pan's sides and begins to coagulate.\nReturn pan to burner. Rotate pan so any uncooked egg in the center moves to perimeter of pan. Cook egg evenly, 15 to 20 seconds.\nQuickly place the filling in the center of the omelet. Fold the omelet over the filling by tilting the pan a little higher off the burner and using a spatula to fold the omelet. Turn the omelet onto a plate, and serve.",
        "title": "Omelettes"
      },
      {
        "ingredients": [
          "1 cup wild rice",
          "3 cups all-purpose flour",
          "1/4 cup sugar",
          "2 tablespoons baking powder",
          "1/2 teaspoon salt",
          "3 1/2 cups whole milk, plus more if needed",
          "1 tablespoon vanilla",
          "2 large eggs",
          "2 tablespoons salted butter, melted, plus more for the skillet and serving",
          "6 chicken sausage links",
          "Pancake syrup, warmed, for serving",
          "Halved strawberries, for serving",
          "Honeydew melon chunks, for serving",
          "Blueberries, for serving"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Watch how to make this recipe.\nCook the wild rice according to the package instructions. (Do not add salt or cook it in broth; just cook in plain water.) Set aside.\nMix together the flour, sugar, baking powder and salt in a large bowl. Mix together the milk, vanilla and eggs in a separate bowl. Add the wet ingredients to the dry ingredients, stirring very gently until just combined. Add more milk if the batter seems too thick. It should definitely be thick but easily pourable. Add the melted butter to the batter, stirring gently to combine. Gently stir in the cooked wild rice. (Add half at first and see how you like the looks of the batter. Then slowly add in as much as you want.)\nHeat a skillet over medium-low heat and add some butter. Pour large spoonfuls of the batter onto the skillet and cook until the pancakes are golden brown, 3 to 4 minutes per side. Repeat with the remaining batter.\nCook the sausage links according to the package instructions.\nServe the pancakes with an obscene amount of butter and warm syrup, along with some strawberries, melon chunks and blueberries.",
        "title": "Wild Rice Pancakes"
      },
      {
        "instructions": "Combine the pork, onion, garlic, 1/2 cup water, 1 teaspoon salt and a few grinds of pepper in a 6- to 8-quart slow cooker. Cover and cook on low, 7 hours.\nRemove the pork and garlic from the slow cooker to a bowl using a slotted spoon. Strain the juices, discarding the onion; transfer 3/4 cup of the juices to a small saucepan. Add the ketchup, mustard, brown sugar, pickle brine and hot sauce. Cook over medium-high heat, stirring occasionally, until the sauce is just starting to simmer and thicken, about 5 minutes.\nHeat the vegetable oil in a large skillet (preferably cast-iron) over high heat. Add the pork and garlic; shred the meat with two forks. Cook, stirring occasionally, until the pork is crisp and golden, about 5 minutes. Season with salt and pepper.\nToast the bread. Top with the pork, sauce and coleslaw. Serve with the pickles.",
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "ingredients": [
          "1 2-pound boneless pork shoulder, cut into 2-inch pieces",
          "1/2 onion, roughly chopped",
          "4 cloves garlic",
          "Kosher salt and freshly ground pepper",
          "3/4 cup ketchup",
          "2 tablespoons spicy yellow mustard",
          "2 tablespoons packed light brown sugar",
          "1/4 cup sliced pickles, plus 2 tablespoons brine",
          "2 teaspoons hot sauce",
          "2 tablespoons vegetable oil",
          "4 slices Texas toast or other thick white bread",
          "1 1/4 cups prepared coleslaw"
        ],
        "title": "Slow-Cooker Pulled Pork Sandwiches"
      },
      {
        "ingredients": [
          "1/4 cup honey",
          "2 3\" strips lemon peel",
          "1 tablespoon fresh lemon juice",
          "2 cups fresh (or frozen, thawed) cherries (about 1 pound), stemmed, pitted, halved",
          "4 tablespoons (1/2 stick) unsalted butter, divided",
          "4 large eggs",
          "3/4 cup all-purpose flour",
          "3/4 cup whole milk",
          "3 tablespoons sugar, divided",
          "1 teaspoon vanilla extract",
          "1/4 teaspoon kosher salt",
          "2 peaches, halved, pitted, cut into 1/4\"-thick wedges",
          "Powdered sugar (for dusting)"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "For compote: Bring honey, lemon peel, lemon juice, and 1/2 cup water to a boil in a small heavy saucepan. Add cherries and simmer briskly, stirring occasionally, until sauce is syrupy, about 15 minutes. Transfer cherry compote to a medium bowl and chill. DO AHEAD: Compote can be made 1 day ahead. Cover and chill. Remove lemon peel just before serving.\nBring honey, lemon peel, lemon juice, and 1/2 cup water to a boil in a small heavy saucepan. Add cherries and simmer briskly, stirring occasionally, until sauce is syrupy, about 15 minutes. Transfer cherry compote to a medium bowl and chill. DO AHEAD: Compote can be made 1 day ahead. Cover and chill. Remove lemon peel just before serving.\nFor pancake: Preheat oven to 425°F. Melt 2 tablespoons butter in a small saucepan; scrape into a blender. Add eggs, flour, milk, 1 tablespoon sugar, vanilla extract, and salt. Blend batter until smooth; set aside in blender. Heat a 12\" cast-iron skillet over medium heat. Add remaining 2 tablespoons butter and remaining 2 tablespoons sugar and cook, stirring constantly, until sugar starts to caramelize, about 2 minutes. Add peaches to skillet; increase heat to medium-high and cook, stirring frequently, until softened, about 2 minutes. Briefly reblend reserved pancake batter. Pour evenly over peaches and transfer to oven. Bake pancake until puffed and golden brown all over, 17-20 minutes (it will deflate as soon as it's removed from the oven). Dust pancake with powdered sugar and serve immediately, passing cherry compote alongside.\nPreheat oven to 425°F. Melt 2 tablespoons butter in a small saucepan; scrape into a blender. Add eggs, flour, milk, 1 tablespoon sugar, vanilla extract, and salt. Blend batter until smooth; set aside in blender.\nHeat a 12\" cast-iron skillet over medium heat. Add remaining 2 tablespoons butter and remaining 2 tablespoons sugar and cook, stirring constantly, until sugar starts to caramelize, about 2 minutes. Add peaches to skillet; increase heat to medium-high and cook, stirring frequently, until softened, about 2 minutes. Briefly reblend reserved pancake batter. Pour evenly over peaches and transfer to oven.\nBake pancake until puffed and golden brown all over, 17-20 minutes (it will deflate as soon as it's removed from the oven). Dust pancake with powdered sugar and serve immediately, passing cherry compote alongside.",
        "title": "Peach Dutch Baby Pancake with Cherry Compote "
      },
      {
        "ingredients": [
          "1/2 cup frozen peas",
          "1 medium onion, peeled",
          "4 large russet or Idaho potatoes (about 3 1/2 pounds), peeled",
          "2 large eggs",
          "2 tablespoons all-purpose flour",
          "1/4 teaspoon ground coriander",
          "1/4 teaspoon ground turmeric",
          "1/4 teaspoon ground cumin",
          "2 tablespoons minced peeled fresh ginger",
          "2 tablespoons minced fresh cilantro",
          "6 tablespoons vegetable oil",
          "6 tablespoons unsalted butter",
          "Curry-Lime Yogurt"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Preheat oven to 200°F. Place 2 nonstick baking sheets in oven. In small saucepan, bring salted water to boil. Add peas and cook, uncovered, until heated through, about 2 to 3 minutes. Drain, then rinse in colander under cool, running water. Set aside in colander to drain completely. Using box grater or food processor fitted with grating disc, coarsely grate onion and place in colander set in sink. Coarsely grate potatoes, add to colander, and set aside to drain. In large mixing bowl, lightly beat eggs. Whisk in flour, coriander, turmeric, and cumin. Mix in ginger, cilantro, and peas. Press potatoes and onion to extract as much liquid as possible, then add to bowl. Season mixture with salt and freshly ground black pepper. Using wooden spoon or hands, mix well, but do not overwork. In heavy-bottomed, 12-inch skillet over moderately high heat, heat 1 tablespoon oil and 1 tablespoon butter until hot but not smoking. Drop 4 scant 1/4-cup portions of potato mixture into pan and flatten with spatula to form four 3-inch pancakes. Fry until bottoms are golden-brown, 4 to 5 minutes, then turn over and fry until golden-brown and crisp, an additional 4 to 5 minutes. Transfer to paper towels to drain; season immediately with salt and pepper. Keep warm on baking sheets in oven while making remaining pancakes. Using paper towels, carefully wipe out pan. And 1 tablespoon oil and 1 tablespoon butter and fry 4 more pancakes. Repeat with remaining batter, wiping out pan and adding 1 tablespoon oil and 1 tablespoon butter before each batch. Serve pancakes hot with Curry-Lime Yogurt.\nPreheat oven to 200°F. Place 2 nonstick baking sheets in oven.\nIn small saucepan, bring salted water to boil. Add peas and cook, uncovered, until heated through, about 2 to 3 minutes. Drain, then rinse in colander under cool, running water. Set aside in colander to drain completely.\nUsing box grater or food processor fitted with grating disc, coarsely grate onion and place in colander set in sink. Coarsely grate potatoes, add to colander, and set aside to drain.\nIn large mixing bowl, lightly beat eggs. Whisk in flour, coriander, turmeric, and cumin. Mix in ginger, cilantro, and peas.\nPress potatoes and onion to extract as much liquid as possible, then add to bowl. Season mixture with salt and freshly ground black pepper. Using wooden spoon or hands, mix well, but do not overwork.\nIn heavy-bottomed, 12-inch skillet over moderately high heat, heat 1 tablespoon oil and 1 tablespoon butter until hot but not smoking. Drop 4 scant 1/4-cup portions of potato mixture into pan and flatten with spatula to form four 3-inch pancakes.\nFry until bottoms are golden-brown, 4 to 5 minutes, then turn over and fry until golden-brown and crisp, an additional 4 to 5 minutes. Transfer to paper towels to drain; season immediately with salt and pepper. Keep warm on baking sheets in oven while making remaining pancakes.\nUsing paper towels, carefully wipe out pan. And 1 tablespoon oil and 1 tablespoon butter and fry 4 more pancakes. Repeat with remaining batter, wiping out pan and adding 1 tablespoon oil and 1 tablespoon butter before each batch.\nServe pancakes hot with Curry-Lime Yogurt.",
        "title": "Indian Potato Pancakes with Curry-Lime Yogurt "
      },
      {
        "ingredients": [
          "2 cups all-purpose flour",
          "1/4 cup plus 1 tablespoon granulated sugar",
          "1/2 teaspoon baking powder",
          "1/4 teaspoon salt",
          "1 stick (1/2 cup) cold unsalted butter, cut into 1/2-inch cubes",
          "2 large eggs, lightly beaten",
          "1 large egg yolk, lightly beaten with 1 tablespoon water",
          "2 pounds Gala apples (about 4)",
          "3 tablespoons unsalted butter, melted",
          "1 teaspoon finely grated fresh orange zest",
          "1 teaspoon finely grated fresh lemon zest",
          "Pinch of fine sea salt",
          "Pinch of ground cardamom",
          "3 tablespoons mild honey",
          "1 tablespoon Calvados or apple brandy (optional)",
          "1/2 cup chilled heavy cream",
          "1/2 cup crème fraîche or sour cream",
          "1/4 cup mild honey",
          "1/8 teaspoon fine sea salt",
          "Special equipment: parchment paper",
          "Garnish: confectioners sugar; toasted sliced almonds"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Make pastry dough: Whisk together flour, 1/4 cup sugar, baking powder, and salt in a large bowl, then blend in butter with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal. Drizzle with beaten whole eggs and gently stir with a wooden spoon (or pulse in processor) until incorporated. Turn dough out onto a lightly floured surface and gently knead a few times (dough will be very soft). Gently press into a ball and flatten into a 6-inch square. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour.\nWhisk together flour, 1/4 cup sugar, baking powder, and salt in a large bowl, then blend in butter with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal. Drizzle with beaten whole eggs and gently stir with a wooden spoon (or pulse in processor) until incorporated.\nTurn dough out onto a lightly floured surface and gently knead a few times (dough will be very soft). Gently press into a ball and flatten into a 6-inch square. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour.\nMake compote while dough chills: Put oven racks in upper and lower thirds of oven and preheat oven to 400°F. Peel, quarter, and core apples, then cut into 3/4-inch pieces. Stir together butter, zests, sea salt, cardamom, and honey in a 13- by 9-inch glass baking dish, then add apples, stirring to coat, and spread in an even layer. Roast apples in upper third of oven, stirring occasionally, until very tender and any liquid is absorbed, 1 1/4 to 1 1/2 hours. Stir in Calvados (if using) and cool compote 20 minutes. (Leave oven on.)\nPut oven racks in upper and lower thirds of oven and preheat oven to 400°F.\nPeel, quarter, and core apples, then cut into 3/4-inch pieces. Stir together butter, zests, sea salt, cardamom, and honey in a 13- by 9-inch glass baking dish, then add apples, stirring to coat, and spread in an even layer.\nRoast apples in upper third of oven, stirring occasionally, until very tender and any liquid is absorbed, 1 1/4 to 1 1/2 hours. Stir in Calvados (if using) and cool compote 20 minutes. (Leave oven on.)\nAssemble \"Newtons\": Put dough on top of 2 overlapping sheets of wax paper, then top with 2 more overlapping sheets and roll out dough into a square slightly larger than 12 inches (1/8 inch thick). Remove top sheets of paper and trim dough with a small knife into a 12-inch square. Loosely roll dough (with bottom sheets of paper) around rolling pin, then unroll, wax paper side up, onto a parchment-lined baking sheet. Carefully remove wax paper and cut dough into 3 (4-inch-wide) pieces. (If dough becomes too soft to work with, chill briefly.) Spoon one third of apple compote along a long side of each rectangle, leaving a 3/4-inch border on long edge and a 1/2-inch border on either end. Brush some of egg wash along all 4 sides of 1 rectangle, then fold pastry in half lengthwise, covering compote completely. Seal edges (including ends) by crimping with a fork dipped occasionally in granulated sugar. Form 2 more pastries in same manner, then chill on baking sheet 15 minutes. Brush pastries with remaining egg wash and lightly sprinkle with remaining tablespoon granulated sugar. Bake in upper third of oven until golden, 15 to 20 minutes. Cool to warm on baking sheet on a rack.\nPut dough on top of 2 overlapping sheets of wax paper, then top with 2 more overlapping sheets and roll out dough into a square slightly larger than 12 inches (1/8 inch thick). Remove top sheets of paper and trim dough with a small knife into a 12-inch square. Loosely roll dough (with bottom sheets of paper) around rolling pin, then unroll, wax paper side up, onto a parchment-lined baking sheet. Carefully remove wax paper and cut dough into 3 (4-inch-wide) pieces. (If dough becomes too soft to work with, chill briefly.)\nSpoon one third of apple compote along a long side of each rectangle, leaving a 3/4-inch border on long edge and a 1/2-inch border on either end.\nBrush some of egg wash along all 4 sides of 1 rectangle, then fold pastry in half lengthwise, covering compote completely. Seal edges (including ends) by crimping with a fork dipped occasionally in granulated sugar. Form 2 more pastries in same manner, then chill on baking sheet 15 minutes. Brush pastries with remaining egg wash and lightly sprinkle with remaining tablespoon granulated sugar.\nBake in upper third of oven until golden, 15 to 20 minutes. Cool to warm on baking sheet on a rack.\nMake cream while pastries cool: Beat together heavy cream and crème fraîche in a bowl with an electric mixer at high speed until thickened, about 5 minutes. Fold in honey and sea salt until just combined.\nBeat together heavy cream and crème fraîche in a bowl with an electric mixer at high speed until thickened, about 5 minutes. Fold in honey and sea salt until just combined.\nCut pastries crosswise into 1 1/4-inch-wide slices with a serrated knife. Dust generously with confectioners sugar and serve with honey cream.\nCut pastries crosswise into 1 1/4-inch-wide slices with a serrated knife. Dust generously with confectioners sugar and serve with honey cream.",
        "title": "Gala Apple \"Newtons\" with Honey Cream "
      },
      {
        "ingredients": [
          "1 large garlic clove, halved lengthwise",
          "3/4 to 1 cup extra-virgin olive oil",
          "1 (3-oz) Portuguese roll or a 7-inch piece of baguette, cut into 3/4-inch cubes",
          "8 anchovy fillets packed in oil, drained",
          "1 large egg",
          "2 tablespoons fresh lemon juice",
          "3 hearts of romaine (an 18-oz package), leaves separated but left whole",
          "1 oz finely grated Parmigiano-Reggiano (1/2 cup)",
          "Special equipment: a very large salad bowl (preferably wooden)"
        ],
        "type": "Breakfast",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Season salad bowl by rubbing a cut half of garlic and 1 teaspoon oil onto bottom and side of bowl (reserve garlic). Heat 3/4 cup oil with both halves of reserved garlic over moderately high heat, turning garlic until golden, 1 to 2 minutes, then discard garlic. Add bread cubes and sauté, turning occasionally, until golden on all sides, about 2 minutes. Transfer croutons to paper towels to drain. Pour oil through a small fine-mesh sieve into a heatproof measuring cup and add enough additional olive oil to total 6 tablespoons. Put anchovies in salad bowl and mash to a paste using 2 forks. Whisk in egg and lemon juice, then add reserved oil (warm or at room temperature) in a slow stream, whisking until emulsified. Add salt to taste. Add romaine leaves to dressing and toss to coat. Add croutons and toss briefly. Divide salad among 6 large plates, then sprinkle with cheese and pepper to taste. Serve immediately.\nSeason salad bowl by rubbing a cut half of garlic and 1 teaspoon oil onto bottom and side of bowl (reserve garlic).\nHeat 3/4 cup oil with both halves of reserved garlic over moderately high heat, turning garlic until golden, 1 to 2 minutes, then discard garlic. Add bread cubes and sauté, turning occasionally, until golden on all sides, about 2 minutes. Transfer croutons to paper towels to drain. Pour oil through a small fine-mesh sieve into a heatproof measuring cup and add enough additional olive oil to total 6 tablespoons.\nPut anchovies in salad bowl and mash to a paste using 2 forks. Whisk in egg and lemon juice, then add reserved oil (warm or at room temperature) in a slow stream, whisking until emulsified. Add salt to taste.\nAdd romaine leaves to dressing and toss to coat. Add croutons and toss briefly.\nDivide salad among 6 large plates, then sprinkle with cheese and pepper to taste. Serve immediately.",
        "title": "Caesar Salad "
      }
    ],




















    "Lunch": [
      {
        "ingredients": [
          "1/2 teaspoon finely grated fresh lemon zest",
          "1 1/2 tablespoons fresh lemon juice",
          "1/3 cup extra-virgin olive oil",
          "1/4 cup pitted Kalamata olives (1 1/4 oz), cut into slivers",
          "3 tablespoons finely chopped fresh oregano plus 6 large sprigs",
          "1 (3 1/4- to 3 1/2-lb) cleaned whole Spanish mackerel or bluefish (with head and tail)",
          "2 tablespoons vegetable oil",
          "6 (1/4-inch-thick) lemon slices",
          "Special equipment: a 22-inch grill; kitchen string"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "B1.jpg",
        "instructions": "Whisk together zest, lemon juice, and salt and pepper to taste, then add olive oil in a stream, whisking until combined well. Whisk in olives and chopped oregano. Make 1-inch-long slits at 2-inch intervals down middle of fish on both sides with a sharp paring knife, then brush fish all over with vegetable oil and season with salt and pepper. Season fish cavity with salt and pepper, then evenly distribute 3 lemon rounds and 3 oregano sprigs in cavity. Close cavity, then evenly arrange remaining 3 lemon rounds and 3 oregano sprigs on top of fish and tie fish closed with string at 2-inch intervals, securing lemon slices and oregano sprigs to fish. Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate. Grill fish on lightly oiled grill rack, covered only if using gas grill, 15 minutes. Turn fish over using a metal spatula and tongs, then grill until just cooked through, about 15 minutes more. Transfer fish to a large platter using 2 metal spatulas, then cut and discard string. Serve fish with sauce.\nWhisk together zest, lemon juice, and salt and pepper to taste, then add olive oil in a stream, whisking until combined well. Whisk in olives and chopped oregano.\nMake 1-inch-long slits at 2-inch intervals down middle of fish on both sides with a sharp paring knife, then brush fish all over with vegetable oil and season with salt and pepper. Season fish cavity with salt and pepper, then evenly distribute 3 lemon rounds and 3 oregano sprigs in cavity. Close cavity, then evenly arrange remaining 3 lemon rounds and 3 oregano sprigs on top of fish and tie fish closed with string at 2-inch intervals, securing lemon slices and oregano sprigs to fish.\nPrepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate.\nGrill fish on lightly oiled grill rack, covered only if using gas grill, 15 minutes. Turn fish over using a metal spatula and tongs, then grill until just cooked through, about 15 minutes more.\nTransfer fish to a large platter using 2 metal spatulas, then cut and discard string. Serve fish with sauce.",
        "title": "Grilled Whole Mackerel with Lemon, Oregano, and Olives "
      },
      {
        "ingredients": [
          "16 baby red-skinned potatoes (about 1 1/4 pounds)",
          "2 tablespoons (1/4 stick) butter",
          "2 tablespoons chopped Italian parsley"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Using vegetable peeler, remove a narrow strip of peel from around middle of each potato. Cook potatoes in large pot of boiling salted water until just tender, about 15 minutes. Drain. (Can be prepared 1 day ahead. Cover and refrigerate.) Melt butter in large nonstick skillet over medium-high heat. Add potatoes and sauté until crisp and golden, about 7 minutes. Season with salt and pepper. Transfer to bowl. Sprinkle with parsley.\nUsing vegetable peeler, remove a narrow strip of peel from around middle of each potato. Cook potatoes in large pot of boiling salted water until just tender, about 15 minutes. Drain. (Can be prepared 1 day ahead. Cover and refrigerate.)\nMelt butter in large nonstick skillet over medium-high heat. Add potatoes and sauté until crisp and golden, about 7 minutes. Season with salt and pepper. Transfer to bowl. Sprinkle with parsley.",
        "title": "Sauteed New Potatoes with Parsley "
      },
      {
        "ingredients": [
          "1/2 cup chopped onion, divided",
          "1 tablespoon olive oil plus additional for brushing",
          "1/2 cup bulgur",
          "1 cup water",
          "1 cup canned pinto beans, rinsed and drained",
          "1 1/2 tablespoon soy sauce",
          "3/4 cup walnuts (2 1/2 ounces)",
          "2 garlic cloves, coarsely chopped",
          "1/2 cup packed cilantro sprigs",
          "3/4 teaspoon ground cumin",
          "1/4 teaspoon cayenne",
          "1/4 cup mayonnaise",
          "1/4 teaspoon grated lime zest",
          "1/2 teaspoon fresh lime juice",
          "4 slices multi-grain bread,toasted",
          "Equipment: a perforated grill sheet",
          "Accompaniments: lettuce; sliced tomato"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Cook half of onion with 1/4 teaspoon salt in oil in a small heavy saucepan over medium heat, stirring occasionally, until golden, 5 to 7 minutes. Add bulgur and water and cook, covered, over low heat until water is absorbed, 15 to 18 minutes. Transfer to a bowl and stir in beans and soy sauce. Pulse bulgur mixture, walnuts, garlic, cilantro, cumin, cayenne, a rounded 1/4 teaspoon salt, 1/2 teaspoon pepper, and remaining onion in a food processor until finely chopped. Form rounded 1/2 cups of mixture into 4 (31/2-inch-diameter) patties. Chill at least 10 minutes. While patties chill, stir together mayonnaise, zest, and juice. Prepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas). Put perforated grill sheet on grill and preheat 10 minutes. Brush patties all over with oil. Oil grill sheet, then grill burgers on grill sheet, covered only if using a gas grill, carefully turning once, until golden brown, about 8 minutes total. Serve burgers open-faced on toast with lime mayonnaise.\nCook half of onion with 1/4 teaspoon salt in oil in a small heavy saucepan over medium heat, stirring occasionally, until golden, 5 to 7 minutes. Add bulgur and water and cook, covered, over low heat until water is absorbed, 15 to 18 minutes. Transfer to a bowl and stir in beans and soy sauce.\nPulse bulgur mixture, walnuts, garlic, cilantro, cumin, cayenne, a rounded 1/4 teaspoon salt, 1/2 teaspoon pepper, and remaining onion in a food processor until finely chopped.\nForm rounded 1/2 cups of mixture into 4 (31/2-inch-diameter) patties. Chill at least 10 minutes.\nWhile patties chill, stir together mayonnaise, zest, and juice.\nPrepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas). Put perforated grill sheet on grill and preheat 10 minutes.\nBrush patties all over with oil.\nOil grill sheet, then grill burgers on grill sheet, covered only if using a gas grill, carefully turning once, until golden brown, about 8 minutes total.\nServe burgers open-faced on toast with lime mayonnaise.",
        "title": "Bulgur Veggie Burgers with Lime Mayonnaise "
      },
      {
        "ingredients": [
          "1 small onion, coarsely grated",
          "1 1/2 pounds grass-fed ground beef",
          "1 1/4 teaspoons kosher salt, plus more",
          "1/2 teaspoon freshly ground pepper, plus more",
          "1 tablespoon vegetable oil",
          "Hamburger buns and desired toppings (for serving)"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Using your hands, gently mix onion, beef, 1 1/4 teaspoons salt, and 1/2 teaspoon pepper in a medium bowl. Gently shape into four 1 1/2\"-thick patties (loosely formed patties will be more succulent). Heat oil in a large skillet, preferably cast iron, over medium-high heat. Season patties with salt and pepper, place in skillet, and immediately reduce heat to medium. Cook 4–6 minutes per side for medium-rare. Serve on buns with desired toppings. DO AHEAD: Patties can be formed 4 hours ahead. Cover and chill.\nUsing your hands, gently mix onion, beef, 1 1/4 teaspoons salt, and 1/2 teaspoon pepper in a medium bowl. Gently shape into four 1 1/2\"-thick patties (loosely formed patties will be more succulent).\nHeat oil in a large skillet, preferably cast iron, over medium-high heat. Season patties with salt and pepper, place in skillet, and immediately reduce heat to medium. Cook 4–6 minutes per side for medium-rare. Serve on buns with desired toppings.\nDO AHEAD: Patties can be formed 4 hours ahead. Cover and chill.",
        "title": "Perfect Grass-Fed Beef Burgers "
      },
      {
        "ingredients": [
          "1 15 1/4-ounce can whole kernel corn, drained, 1/2 cup liquid reserved",
          "1/2 cup plus 1 tablespoon cornmeal",
          "1/2 cup finely chopped onion",
          "1/3 cup finely chopped red bell pepper",
          "1/2 teaspoon grated lime peel",
          "1/4 cup cooked white rice",
          "3 tablespoons chopped cilantro",
          "4 teaspoons diced jalapeño chili",
          "1/2 teaspoon salt",
          "1/2 teaspoon ground cumin",
          "Nonstick vegetable oil spray",
          "4 no-lard 9- to 10-inch-diameter flour tortillas (99% fat-free)",
          "8 tablespoons light sour cream",
          "8 tablespoons purchased salsa"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Blend 1/2 cup corn kernels and 1 tablespoon cornmeal in processor until moist clumps form. Add 3/4 cup corn kernels; process 10 seconds (reserve remaining corn for another use). Transfer corn mixture to heavy medium nonstick saucepan. Add 1/2 cup corn liquid, onion, bell pepper and lime peel. Cover and cook over very low heat until thick and firm, stirring often, 12 minutes. Mix in rice, cilantro, jalapeño, salt and cumin. Drop 1/4 of mixture onto each of 4 pieces of foil; press pieces into 3/4-inch-thick patties. Let stand until completely cool. Prepare barbecue (medium heat). Spray both sides of burgers with nonstick spray; grill until crisp, about 5 minutes per side. Grill tortillas until pliable, about 30 seconds per side. Transfer tortillas to plates. On each tortilla place 1 burger, 1/4 of sour cream and 1/4 of salsa. Fold tortillas over to enclose.\nBlend 1/2 cup corn kernels and 1 tablespoon cornmeal in processor until moist clumps form. Add 3/4 cup corn kernels; process 10 seconds (reserve remaining corn for another use). Transfer corn mixture to heavy medium nonstick saucepan. Add 1/2 cup corn liquid, onion, bell pepper and lime peel. Cover and cook over very low heat until thick and firm, stirring often, 12 minutes. Mix in rice, cilantro, jalapeño, salt and cumin. Drop 1/4 of mixture onto each of 4 pieces of foil; press pieces into 3/4-inch-thick patties. Let stand until completely cool.\nPrepare barbecue (medium heat). Spray both sides of burgers with nonstick spray; grill until crisp, about 5 minutes per side. Grill tortillas until pliable, about 30 seconds per side. Transfer tortillas to plates. On each tortilla place 1 burger, 1/4 of sour cream and 1/4 of salsa. Fold tortillas over to enclose.",
        "title": "Tex-Mex Veggie Burgers "
      },
      {
        "ingredients": [
          "2 tablespoons cornstarch",
          "1 1/2 cups (1/2-inch) chunks seitan",
          "1 cup chopped roasted broccoli",
          "6 tablespoons dry bread crumbs",
          "1 teaspoon kosher salt",
          "Vegetable oil, for cooking",
          "Buns and burger toppings (for serving)"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "In a small mixing bowl, combine the cornstarch with 2 tablespoons of water and mix with a fork until the cornstarch is completely dissolved. In a food processor, combine the cornstarch slurry, seitan, broccoli, bread crumbs, and salt, and process until there are no more big chunks and everything is thoroughly mixed. It will look like a strange green oatmeal. Transfer to a bowl and let rest in the refrigerator for at least 30 minutes and up to four days covered. When you are ready for burgers, divide the burger mixture into sixths, shape the portions into rough balls by rolling them in your hands, and gently press them into patties. I like to use a ring mold to make prettier patties, but you probably don’t have one of those, and I applaud your rustic sensibility. Heat a large sauté pan over medium heat with enough oil to slick the pan. When the oil shimmers, place as many patties as will fit comfortably in the pan. Once you see the edges start to caramelize, after about 3 minutes, carefully flip the patties and cook an additional 2 minutes. Put the burgers on buns with whatever toppings make you feel badass, listen to “The Boys Are Back in Town” by Thin Lizzy, eat your super-awesome veggie burger, and flip people off from the window.\nIn a small mixing bowl, combine the cornstarch with 2 tablespoons of water and mix with a fork until the cornstarch is completely dissolved.\nIn a food processor, combine the cornstarch slurry, seitan, broccoli, bread crumbs, and salt, and process until there are no more big chunks and everything is thoroughly mixed. It will look like a strange green oatmeal. Transfer to a bowl and let rest in the refrigerator for at least 30 minutes and up to four days covered.\nWhen you are ready for burgers, divide the burger mixture into sixths, shape the portions into rough balls by rolling them in your hands, and gently press them into patties. I like to use a ring mold to make prettier patties, but you probably don’t have one of those, and I applaud your rustic sensibility.\nHeat a large sauté pan over medium heat with enough oil to slick the pan. When the oil shimmers, place as many patties as will fit comfortably in the pan. Once you see the edges start to caramelize, after about 3 minutes, carefully flip the patties and cook an additional 2 minutes. Put the burgers on buns with whatever toppings make you feel badass, listen to “The Boys Are Back in Town” by Thin Lizzy, eat your super-awesome veggie burger, and flip people off from the window.",
        "title": "Basic Veggie Burgers "
      },
      {
        "ingredients": [
          "1 1/2 tablespoons olive oil",
          "2 1/2-inch-thick eggplant rounds",
          "2 3- to 4-ounce meatless patties",
          "3 tablespoons mayonnaise",
          "2 teaspoons chopped fresh tarragon or 1 teaspoon dried",
          "2 3- to 4-inch square pieces focaccia or ciabatta, split horizontally",
          "2 large 1/2-inch-thick tomato slices",
          "Mixed baby greens"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Heat oil in heavy large skillet over medium heat. Sprinkle eggplant with salt and pepper. Add eggplant to skillet; sauté until brown, about 3 minutes per side. Add patties to same skillet. Sauté until patties and eggplant are cooked through, about 3 minutes per side. Blend mayonnaise and tarragon in small bowl; season with salt and pepper. Spread mayonnaise mixture on bottom half of each bread piece. Top with patty, eggplant, tomato, greens and bread.\nHeat oil in heavy large skillet over medium heat. Sprinkle eggplant with salt and pepper. Add eggplant to skillet; sauté until brown, about 3 minutes per side. Add patties to same skillet. Sauté until patties and eggplant are cooked through, about 3 minutes per side.\nBlend mayonnaise and tarragon in small bowl; season with salt and pepper. Spread mayonnaise mixture on bottom half of each bread piece. Top with patty, eggplant, tomato, greens and bread.",
        "title": "Vegetable Burgers with Eggplant and Tomato "
      },
      {
        "ingredients": [
          "3 pounds lean ground beef",
          "1 cup (packed) crumbled feta cheese",
          "2 teaspoons dried oregano",
          "1 1/2 teaspoons salt",
          "1 1/2 teaspoons ground black pepper",
          "8 large garlic cloves, peeled",
          "1/2 cup plus 1 tablespoon extra-virgin olive oil",
          "Nonstick vegetable oil spray",
          "2 medium red onions, peeled, each cut crosswise into 4 slices",
          "8 hamburger buns",
          "2 large tomatoes, each cut crosswise into 4 slices"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Break up beef in large bowl. Sprinkle feta, oregano, salt, and pepper over; toss. Divide into 8 portions; form each into 41/2-inch patty, pressing in center to form slight indentation. DO AHEAD Can be made 1 day ahead. Cover; chill. Puree garlic in processor. With machine running, gradually add 1/2 cup oil; process 30 seconds. DO AHEAD Can be made 1 day ahead. Cover; chill. Spray grill rack with nonstick spray. Prepare barbecue (medium-high heat). Brush onion with 1 tablespoon oil; sprinkle with salt and pepper. Place burgers and onions on grill. Cover; cook 5 minutes. Turn; cook until onions are charred in spots and burgers are medium-well, about 4 minutes longer.Transfer to plate. Brush cut sides of buns with garlic oil. Place buns, cut side down, on grill; toast about 1 minute. Turn; cook until heated, about 1 minute. Place burgers on bun bottoms. Top each with onion, tomato, and bun top.\nBreak up beef in large bowl. Sprinkle feta, oregano, salt, and pepper over; toss. Divide into 8 portions; form each into 41/2-inch patty, pressing in center to form slight indentation. DO AHEAD Can be made 1 day ahead. Cover; chill.\nPuree garlic in processor. With machine running, gradually add 1/2 cup oil; process 30 seconds. DO AHEAD Can be made 1 day ahead. Cover; chill.\nSpray grill rack with nonstick spray. Prepare barbecue (medium-high heat). Brush onion with 1 tablespoon oil; sprinkle with salt and pepper. Place burgers and onions on grill. Cover; cook 5 minutes. Turn; cook until onions are charred in spots and burgers are medium-well, about 4 minutes longer.Transfer to plate. Brush cut sides of buns with garlic oil. Place buns, cut side down, on grill; toast about 1 minute. Turn; cook until heated, about 1 minute.\nPlace burgers on bun bottoms. Top each with onion, tomato, and bun top.",
        "title": "Feta Burgers with Grilled Red Onions "
      },
      {
        "ingredients": [
          "10 ounces skinless salmon fillet, cut into 1-inch pieces",
          "3 tablespoons plus 1/2 cup purchased tartar sauce",
          "2 tablespoons chopped fresh dill",
          "1/4 teaspoon salt",
          "1/4 teaspoon ground black pepper",
          "1 teaspoon grated lemon peel",
          "2 sesame-seed rolls, split",
          "Red onion slices",
          "4 Bibb lettuce leaves"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Place salmon fillets, 3 tablespoons tartar sauce, 1 tablespoon dill, salt, and pepper in processor. Blend using on/off turns until coarsely ground. Form into two 1/2-inch-thick patties. (Can be made 6 hours ahead. Cover and refrigerate.) Prepare barbecue (medium-high heat). Whisk 1/2 cup tartar sauce, 1 tablespoon dill, and lemon peel in medium bowl to blend. Grill rolls until toasted. Transfer to 2 plates and spread bottom halves generously with sauce. Grill patties until fish is cooked through, about 2 minutes per side. Place burgers atop sauce on rolls. Top each with onion slices, 2 lettuce leaves, and top half of roll. Serve, passing remaining sauce separately.\nPlace salmon fillets, 3 tablespoons tartar sauce, 1 tablespoon dill, salt, and pepper in processor. Blend using on/off turns until coarsely ground. Form into two 1/2-inch-thick patties. (Can be made 6 hours ahead. Cover and refrigerate.)\nPrepare barbecue (medium-high heat). Whisk 1/2 cup tartar sauce, 1 tablespoon dill, and lemon peel in medium bowl to blend. Grill rolls until toasted. Transfer to 2 plates and spread bottom halves generously with sauce. Grill patties until fish is cooked through, about 2 minutes per side. Place burgers atop sauce on rolls. Top each with onion slices, 2 lettuce leaves, and top half of roll. Serve, passing remaining sauce separately.",
        "title": "Salmon Burgers with Dill Tartar Sauce "
      },
      {
        "ingredients": [
          "1/4 cup mayonnaise",
          "1/4 cup finely chopped celery",
          "1 teaspoon fresh lemon juice",
          "1/2 teaspoon grated lemon peel",
          "3 tablespoons chopped fresh chives",
          "1 11- to 12-ounce frozen lobster tail, thawed",
          "4 slices egg bread, toasted"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Combine first 4 ingredients and 2 tablespoons chives in medium bowl. Cook lobster in medium pot of boiling salted water until just opaque in center, about 8 minutes. Drain; cool. Remove meat from shell. Dice lobster; fold into mayonnaise mixture. Season with salt and pepper. Spoon salad atop bread slices. Sprinkle with 1 tablespoon chives and serve.\nCombine first 4 ingredients and 2 tablespoons chives in medium bowl. Cook lobster in medium pot of boiling salted water until just opaque in center, about 8 minutes. Drain; cool. Remove meat from shell. Dice lobster; fold into mayonnaise mixture. Season with salt and pepper.\nSpoon salad atop bread slices. Sprinkle with 1 tablespoon chives and serve.",
        "title": "Open Face Lobster Salad Sandwiches "
      },
      {
        "ingredients": [
          "1 1/2 pounds freshly poached salmon filet",
          "2 tablespoons freshly chopped chives",
          "2 tablespoons lemon juice",
          "4 tablespoons sour cream",
          "Kosher salt",
          "Freshly ground pepper",
          "1 large English cucumber",
          "Handful of mustard lettuce leaves",
          "Butter",
          "12 slices thin-sliced pumpernickel, onion, or plain white bread"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Flake 1 1/2 pounds freshly poached salmon filet into small pieces. Place in a bowl and mix with 2 tablespoons freshly chopped chives, 2 tablespoons lemon juice, and 4 tablespoons sour cream. Season with kosher salt and freshly ground pepper. Peel 1 large English cucumber and halve it the long way. Using a mandoline, cut it into long, thin slices about 1/8 inch thick; set aside. Discard the center with the seeds. Wash and dry a handful of mustard lettuce leaves. Butter 1 slice of thin-sliced pumpernickel, onion, or plain white bread. Arrange a single layer of cucumber on it, then top with a flat layer of lettuce. Butter another slice of bread on both sides and place it on top. Top with the salmon, spreading well, but no more than 1/3 inch thick. Butter a final slice of bread and place it over the salmon, butter side down, pressing gently. Using a serrated knife, remove the crusts and slice into rectangles, about 1 1/2 inches wide by 3 inches long. Repeat with another 9 slices of bread.\nFlake 1 1/2 pounds freshly poached salmon filet into small pieces. Place in a bowl and mix with 2 tablespoons freshly chopped chives, 2 tablespoons lemon juice, and 4 tablespoons sour cream. Season with kosher salt and freshly ground pepper.\nPeel 1 large English cucumber and halve it the long way. Using a mandoline, cut it into long, thin slices about 1/8 inch thick; set aside. Discard the center with the seeds. Wash and dry a handful of mustard lettuce leaves.\nButter 1 slice of thin-sliced pumpernickel, onion, or plain white bread. Arrange a single layer of cucumber on it, then top with a flat layer of lettuce. Butter another slice of bread on both sides and place it on top. Top with the salmon, spreading well, but no more than 1/3 inch thick. Butter a final slice of bread and place it over the salmon, butter side down, pressing gently. Using a serrated knife, remove the crusts and slice into rectangles, about 1 1/2 inches wide by 3 inches long. Repeat with another 9 slices of bread.",
        "title": "Salmon and Cucumber Layered Sandwiches "
      },
      {
        "ingredients": [
          "1/2 cup freshly grated Parmesan (about 1 1/2 ounces)",
          "1/4 cup mayonnaise",
          "1 pound thin asparagus",
          "4 slices Italian or other white bread",
          "2 teaspoons unsalted butter, softened",
          "1/4 pound sliced cooked ham"
        ],
        "type": "Lunch",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Preheat broiler. In a small bowl stir together Parmesan and mayonnaise. Trim asparagus to fit bread and arrange asparagus in a skillet just large enough to hold it in one layer. Add 1/2 inch salted cold water and cook asparagus, covered, over moderately high heat 5 minutes, or until just tender. In a colander drain asparagus well. Arrange bread on a baking sheet and butter top of each slice. Broil bread about 6 inches from heat until golden, about 2 minutes. Turn bread over and arrange ham on each slice, folding or trimming to fit if necessary. Arrange asparagus on ham and spread with Parmesan mixture. Broil sandwiches about 3 inches from heat until golden, 1 to 2 minutes.\nPreheat broiler.\nIn a small bowl stir together Parmesan and mayonnaise. Trim asparagus to fit bread and arrange asparagus in a skillet just large enough to hold it in one layer. Add 1/2 inch salted cold water and cook asparagus, covered, over moderately high heat 5 minutes, or until just tender. In a colander drain asparagus well.\nArrange bread on a baking sheet and butter top of each slice. Broil bread about 6 inches from heat until golden, about 2 minutes. Turn bread over and arrange ham on each slice, folding or trimming to fit if necessary. Arrange asparagus on ham and spread with Parmesan mixture. Broil sandwiches about 3 inches from heat until golden, 1 to 2 minutes.",
        "title": "Asparagus, Ham, and Cheese Melts "
      },
      {
        "instructions": "Make the Det Mix: Combine all the ingredients in a bowl.\nMake the hamburgers: Heat the butter and oil in a large cast iron skillet over high heat. Add the hamburgers and cook halfway through and turn over. Cover each with about 1/4 cup of the Det Mix and top with the onion slices. Pour in the 1/4 cup beer and cover with a lid. Steam a couple of minutes until the onion is translucent. Re-steam with beer a couple of times. Top each hamburger with a slice of cheese and cover until melted. Transfer the hamburger to the buns and serve.\nSpread the meat out on a board and grate 2 to 3 tablespoons of onion into it¿use a fairly fine grater so you get just the juice and very finely grated raw onion. Now mix in about a tablespoon of heavy cream and some freshly ground black pepper. Form into patties¿a 6 to 8-ounce patty for an average serving.",
        "ingredients": [
          "1/3 cup drained, sliced canned whole green chiles",
          "1/3 cup sliced pitted oil-cured black olives",
          "1/3 cup sliced sauteed cremini mushrooms",
          "2 tablespoons unsalted butter",
          "2 tablespoons vegetable oil",
          "4 James Beard's Favorite Hamburger patties, recipe follows",
          "4 slices onion",
          "1/4 cup beer, plus more as needed",
          "4 slices cheddar cheese",
          "4 toasted hamburger buns",
          "Recipe courtesy Beard on Food, Running Press, 2000",
          "2 pounds chopped beef chuck or round",
          "1 onion",
          "1 tablespoon heavy cream",
          "Freshly ground black pepper, to taste",
          "Unsalted butter",
          "Vegetable oil, as needed",
          "Kosher salt, to taste"
        ],
        "title": "The Det Burger",
        "type": "Lunch",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Prepare 2 small saucepans over low heat. To the first, add the mirin and 3 teaspoons of ginger and simmer until the mixture is about 3/4 reduced and is a dark caramel color. To the second, add the chicken stock and reduce by about 1/2. Slowly pour the mirin mixture into the chicken stock and bring to a simmer. Add the soy sauce and pineapple juice and reduce again by 1/4. Let the mixture cool.\nIn a large mixing bowl, combine the ground beef, ginger, garlic, salt and pepper. When well mixed, form the beef into four 6-ounce patties. Brush all sides of the burgers with the teriyaki sauce and place in either a hot grill or 450 degree oven. Continue brushing with the teriyaki as the burger cooks until the desired doneness is achieved.\nUsing a food processor, combine the garlic, anchovies, pepper, and hot pepper sauce. Blend in the rice vinegar, and egg yolk. With the processor running, slowly drizzle The oils until a consistency of thin mayonnaise is reached. Refrigerate until ready for use.\nUsing a mandoline, cut the potatoes into match-sized sticks. Fill a fryer or medium heavy pot one-third full with the oil and heat over high heat to 350 degrees. Add the potatoes to the oil and fry until golden brown, about 5 to 6 minutes. Drain on paper towels and sprinkle with the salt.\nPlating: Cut the bread into 8 slices and toast on a grill or under a broiler. Top one side of the bread with the lettuce and tomato and place the burger on top. Place a mound of the salad next to the burger and arrange a handful of the potatoes on top of the salad.",
        "ingredients": [
          "1 bottle mirin",
          "3 teaspoons fresh ginger, chopped, plus 1 tablespoon minced",
          "3 cups chicken stock",
          "2 tablespoons soy sauce",
          "1 (6-ounce) can pineapple juice",
          "2 pounds ground beef",
          "1 tablespoon minced garlic",
          "Salt and pepper",
          "4 leaves red leaf lettuce",
          "4 tomato slices",
          "Crusty sourdough bread, toasted",
          "1 clove garlic",
          "5 anchovy fillets",
          "1/2 cup Parmesan, shredded",
          "1 tablespoon black pepper",
          "1/2 cup rice vinegar",
          "4 splashes hot pepper sauce",
          "1 egg yolk",
          "1 1/2 cups canola oil",
          "1 tablespoon sesame oil",
          "4 cups Romaine lettuce, chopped",
          "3 large waxy potatoes, like Yukon gold, washed",
          "Canola oil, for deep-frying",
          "Salt"
        ],
        "title": "Teriyaki Burger with Caesar Salad and Shoestring Potatoes",
        "type": "Lunch",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "In a medium saute pan over medium-high heat, melt 4 tablespoons of the butter. When the foam subsides, fry the cubes of bread until golden and crusty, about 4 to 7 minutes. Remove the croutons from the pan with a slotted spatula and set aside on paper towels to drain. Wipe out the pan.\nPlace the flour on a plate and season well with salt and pepper. Dredge the halibut in the flour and shake off excess.\nReturn the saute pan to the heat and melt 4 more tablespoons of butter. When the foam has subsided add the fish to the pan. Cook, turning once, until the fish is no longer translucent in the center, flakes easily, and is golden brown on both sides, about 4 to 7 minutes per side. Transfer the fish to a serving platter and wipe out the pan.\nMelt the additional 2 tablespoons of butter, and when the foam subsides add the capers and croutons. Saute briefly, then add the lemon juice and parsley and swirl to combine. Pour over the fish on the serving dish and serve immediately.",
        "ingredients": [
          "1 stick plus 2 tablespoons butter",
          "6 slices stale white sandwich bread, crusts removed and cut into 1/2-inch cubes",
          "1/2 cup all-purpose flour",
          "Salt and freshly ground black pepper",
          "4 (6-ounce) pieces halibut (preferably Pacific)",
          "1 to 2 tablespoons capers (depending on taste)",
          "1 large lemon, juiced",
          "1 tablespoon finely chopped fresh parsley leaves"
        ],
        "title": "Halibut with Lemon, Capers, and Croutons",
        "type": "Lunch",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Mix the mayo and chopped herbs together. Divide the mixture evenly and spread it onto the bread slices. Put 1 layer of sliced onion onto 4 of the slices and top with the remaining bread. Using an electric knife, cut the crusts off then cut each sandwich in half.\nCombine the cream cheese, dill, and lemon juice. Divide the mixture evenly and spread it onto the bread slices. Place a layer of cucumber onto 4 bread slices and top with a layer of smoked salmon. Top with the remaining bread. Using an electric knife, cut the crusts off, then cut each sandwich in half.\nSpread some mayonnaise onto a slice of bread and place it on your work surface. Top with some lettuce, a layer of tomato, and a slice of ham. Spread some mayonnaise onto another slice of bread and place it, mayonnaise side down, on top of the ham. Spread some butter onto the top of this piece of bread and add a layer of cucumber, a slice of turkey, a slice of Muenster cheese, and some alfalfa sprouts. Butter another slice of bread and place it, butter side down, on top of the sprouts. Repeat to make 3 more sandwiches. Using an electric knife, cut the crusts off, then cut each sandwich in half.",
        "ingredients": [
          "1 cup mayonnaise",
          "1 tablespoon chopped fresh parsley leaves",
          "1 tablespoon chopped fresh tarragon leaves",
          "8 slices white bread",
          "1 Vidalia onion, sliced very thin",
          "1 cup whipped cream cheese",
          "1 tablespoon chopped fresh dill",
          "1 lemon, juiced",
          "8 slices white bread",
          "1/2 cucumber, very thinly sliced",
          "4 ounces smoked salmon",
          "12 slices white bread",
          "1/4 cup mayonnaise",
          "1/4 head iceberg lettuce, finely shredded",
          "1 tomato, very thinly sliced",
          "4 slices ham",
          "4 tablespoons unsalted butter, softened",
          "1/2 cucumber, very thinly sliced",
          "4 slices turkey",
          "4 slices Muenster cheese",
          "1/2 cup alfalfa sprouts"
        ],
        "title": "Three Tasty Tea Sandwiches",
        "type": "Lunch",
        "popularity": 0,
        "picture_link": ""
      }
    ],













    "Dinner": [
      {
        "ingredients": [
          "1/4 lb Shanghai bok choy (about 3 small heads)",
          "1 medium carrot",
          "2 1/2 tablespoons vegetable oil",
          "1 (1 1/2-inch) piece peeled fresh ginger, cut into very thin matchsticks",
          "1/4 cup medium-dry Sherry",
          "2 cups reduced-sodium chicken broth (16 fl ounces)",
          "2 teaspoons sugar",
          "3 scallions",
          "4 (4- to 5-ounce) sea bass or striped bass fillets with skin, pin bones removed",
          "1 teaspoon salt",
          "1/2 teaspoon black pepper",
          "1 teaspoon cornstarch",
          "1 teaspoon curry powder",
          "1 teaspoon Asian sesame oil",
          "Garnish: fresh cilantro leaves"
        ],
        "type": "Dinner",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Discard any bruised or wilted outer leaves from bok choy, then cut leaves from stalks, keeping leaves and stalks separate. Thinly slice leaves and cut stalks diagonally into 1/2-inch-wide slices. Halve carrot lengthwise and cut diagonally into 1/4-inch-thick slices. Heat 1 tablespoon vegetable oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then stir-fry bok choy stalks, carrot, and ginger 1 minute. Stir in Sherry, broth, and sugar and simmer, covered, 5 minutes. Meanwhile, cut scallions crosswise into 2-inch pieces, then halve lengthwise and cut into very thin matchsticks. Add bok choy leaves and scallions to carrot mixture and simmer, covered, until vegetables are tender, 3 to 5 minutes. While vegetables simmer, pat fish dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Stir together cornstarch and curry powder, then rub into skin of each fillet. Halve each fillet diagonally with a sharp knife. Stir sesame oil, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper into vegetable mixture and keep warm, uncovered, on turned-off burner. Heat remaining 1 1/2 tablespoons vegetable oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook fish, skin sides down, gently pressing occasionally with a metal spatula (to keep skin flat), until skin is golden, 2 to 3 minutes. Turn fish over and cook until just cooked through, about 2 minutes more. Remove from heat. Divide broth and vegetables among 4 shallow bowls and stack 2 fish halves, skin sides up, in center of each bowl.\nDiscard any bruised or wilted outer leaves from bok choy, then cut leaves from stalks, keeping leaves and stalks separate. Thinly slice leaves and cut stalks diagonally into 1/2-inch-wide slices. Halve carrot lengthwise and cut diagonally into 1/4-inch-thick slices.\nHeat 1 tablespoon vegetable oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then stir-fry bok choy stalks, carrot, and ginger 1 minute. Stir in Sherry, broth, and sugar and simmer, covered, 5 minutes.\nMeanwhile, cut scallions crosswise into 2-inch pieces, then halve lengthwise and cut into very thin matchsticks.\nAdd bok choy leaves and scallions to carrot mixture and simmer, covered, until vegetables are tender, 3 to 5 minutes.\nWhile vegetables simmer, pat fish dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Stir together cornstarch and curry powder, then rub into skin of each fillet. Halve each fillet diagonally with a sharp knife.\nStir sesame oil, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper into vegetable mixture and keep warm, uncovered, on turned-off burner.\nHeat remaining 1 1/2 tablespoons vegetable oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook fish, skin sides down, gently pressing occasionally with a metal spatula (to keep skin flat), until skin is golden, 2 to 3 minutes. Turn fish over and cook until just cooked through, about 2 minutes more. Remove from heat.\nDivide broth and vegetables among 4 shallow bowls and stack 2 fish halves, skin sides up, in center of each bowl.",
        "title": "Pan-Seared Fish Fillets in Ginger Broth "
      },
      {
        "ingredients": [
          "3 tablespoons extra-virgin olive oil",
          "8 ounces thinly sliced pancetta (Italian bacon), chopped",
          "2 cups thinly sliced celery hearts",
          "1 2/3 cups chopped onion",
          "1 pound Treviso radicchio or red endive (4 medium heads), quartered lengthwise, cored, then cut on diagonal into thin strips (about 6 cups), divided",
          "3 teaspoons chopped fresh thyme, divided",
          "1 garlic clove, finely chopped",
          "9 lasagna noodles (each 7 x 3 inches)",
          "1/4 cup (1/2 stick) unsalted butter",
          "2 1/2 tablespoons all purpose flour",
          "2 cups whole milk",
          "Pinch of ground nutmeg",
          "Pinch of ground white pepper",
          "12 ounces Taleggio cheese,* rind removed, cheese cut into 1/2-inch cubes",
          "1/2 cup finely grated Parmesan cheese, divided",
          "2 tablespoons coarse dry breadcrumbs (preferably from crustless Italian bread)",
          "Olive oil"
        ],
        "type": "Dinner",
        "popularity": 0,
        "picture_link": "",
        "instructions": "For filling and pasta: Heat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper. Cook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.\nHeat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper.\nCook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.\nFor sauce: Melt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper. Spoon 1/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2/3 cup sauce; sprinkle with 1/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2/3 cup sauce. Spoon reserved 3/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing. Preheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes. Toss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme.\nMelt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper.\nSpoon 1/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2/3 cup sauce; sprinkle with 1/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2/3 cup sauce. Spoon reserved 3/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing.\nPreheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes.\nToss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme.",
        "title": "Pancetta and Taleggio Lasagna with Treviso "
      },
      {
        "instructions": "Preheat the oven to 450 degrees F.\nPlace the salmon piece or fillets skin-side up in a shallow ovenproof dish. Cook in the oven for 15 minutes.\nMeanwhile gently melt the butter in a small saucepan. Remove from the heat and stir in the mustard and dill. Season to taste. Remove the salmon from the oven and arrange the scallops round it, baste with the mustard sauce.\nReturn to the oven for a further 5 minutes. Slice the salmon quite thickly and serve on top of the spinach rocket and spoon over the mustard butter.",
        "ingredients": [
          "2 pounds salmon middle cut, boned, or fillets",
          "6 ounces butter",
          "8 scallops, without roe",
          "3 generous teaspoons wholegrain mustard",
          "4 level teaspoons dried dill wood, or 2 teaspoons each of dried and fresh dill",
          "Salt and freshly ground pepper",
          "10 ounces fresh spinach or rocket (arugula)"
        ],
        "title": "Roasted Salmon with Scallops and Mustard Butter",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Preheat oven to high. Cut potatoes and spread out on a cookie sheet. Coat potatoes with extra-virgin olive oil, dried herbs and steak seasoning or, salt and pepper. Spread potatoes to the corners of the cookie sheet. Cook potatoes in very hot oven 25 minutes. Turn potatoes once, half way in the cooking process. Serve fries hot from the oven.",
        "ingredients": [
          "5 russet potatoes, cut into thin wedges",
          "3 tablespoons extra-virgin olive oil",
          "1 teaspoon dried thyme, eyeball it",
          "1 teaspoon dried oregano, eyeball it",
          "1 tablespoon steak seasoning blend, such as Montreal Steak Seasoning, or salt and pepper"
        ],
        "title": "Oven Steak Fries",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Preheat a grill on medium-high heat.\nBring a large pot of salted water to a boil, cook pasta about half way according to package instructions. Drain the pasta and toss lightly with olive oil. Using a grill grate, grill the pasta over medium-high heat for about 3 to 4 minutes.\nTransfer the grilled pasta to a serving platter and spoon BBQ Gravy over the top. Place meatballs over the top and around the perimeter of the platter and top with more Gravy. Sprinkle with the sliced scallions and grated Parmesan.\nHeat a large soup pot over medium-high heat. Add the olive oil and heat for 1 minute. When the oil is hot, add the bacon and render. When golden brown and beginning to crisp, add minced carrot, celery, onion, and garlic. Add a pinch of salt and saute vegetables to a light brown. Add rosemary and brown sugar and stir. Add Chianti and vinegar to pot, stir and bring to boil. Add the tomato paste, chipotles in adobo, and the chopped tomatoes. Stir and simmer for 1 to 1 1/2 hours, skimming the top occasionally to remove any scum that forms.\nWhile the BBQ gravy is simmering, make the meatballs.\nIn a large bowl, mix together the meat, egg, Worcestershire, cheese, parsley, oregano, basil, onion, bread crumbs, and garlic, and season with salt and pepper. Add 1/2 cup of water. Knead the water into the meat mixture with your hands. Knead and roll meatballs into about 1 1/2-inch balls. Place them in shallow saucepan on stove, add another 1/2 cup of water over them, and cover. Turn heat to medium, and steam for 35 minutes.\nUsing a slotted spoon, remove the meatballs from the pan. Drain the juice out of the bottom of the pan, return the meatballs to it and cover them with warm BBQ gravy. Serve on top of Grilled Spaghetti.",
        "ingredients": [
          "1 1/2 pounds spaghetti",
          "Meatballs in BBQ Gravy, recipe follows",
          "Extra-virgin olive oil",
          "2 tablespoons scallions, thinly sliced",
          "Grated Parmesan",
          "For the gravy:",
          "1 pound bacon, sliced into lardons",
          "1/2 cup olive oil",
          "1 carrot, chopped",
          "1 stalk celery, chopped",
          "1 onion, chopped",
          "4 cloves garlic, minced",
          "1 tablespoon fresh rosemary leaves, minced",
          "2 tablespoons brown sugar",
          "1 1/2 glasses Chianti",
          "3 tablespoons cider vinegar",
          "1 small can tomato paste",
          "1 small can chipotle peppers in adobo",
          "3 (28-ounce) cans chopped tomatoes",
          "Sea salt, preferable grey",
          "Freshly ground black pepper",
          "1 pound ground sirloin",
          "1 large egg",
          "1 tablespoon Worcestershire sauce",
          "2 tablespoons Parmesan, freshly grated",
          "2 tablespoons finely chopped flat-leaf parsley",
          "1 teaspoons dried oregano",
          "1 tablespoon finely chopped basil leaves",
          "1 cup onion, finely chopped",
          "1 cup fine dried bread crumbs",
          "1 clove garlic, minced",
          "Sea salt, preferably grey",
          "Freshly ground black pepper",
          "1 cup water"
        ],
        "title": "Grilled Spaghetti",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "In a small saucepan cook the onion in the butter over moderately low heat, stirring, for 5 minutes, stir in 1/4 cup of the flour, and cook the roux mixture over low heat, stirring, for 3 minutes. Stir in the milk and the broth, cook the mixture, stirring, until it forms a paste, and cook the paste, stirring, for 3 minutes. Remove the pan from the heat, stir in the chicken, the sweet potatoes, the cayenne, and salt and black pepper, to taste, and combine the mixture well.\nChill the chicken mixture, covered, for 2 hours, or until it is firm, and roll level tablespoons of it into balls. Dredge the balls in the additional 1/2 cup flour, shaking off the excess, coat them thoroughly with the egg wash, letting the excess drip off, and dredge them in the bread crumbs, transferring them to wax paper as they are coated. The croquettes may be made up to this point 1 month in advance and kept wrapped well and frozen. Thaw the croquettes for 1 hour. If serving the croquettes immediately, let them dry at room temperature for 1 hour.\nIn a large saucepan heat 2 inches of the oil until a deep-fat thermometer registers 365 degrees F. Fry the croquettes in batches for 1 to 1 1/2 minutes, or until they are golden brown, and transfer them with a slotted spoon to paper towels to drain. Serve the croquettes with mango chutney, if desired.",
        "ingredients": [
          "1/3 cup chopped onion",
          "2 tablespoons unsalted butter",
          "1/4 cup all-purpose flour 1/2 cup additional, for dredging the croquettes",
          "1/4 cup milk",
          "1/4 cup chicken broth",
          "2 cups finely chopped cooked chicken or turkey",
          "1/2 cup mashed sweet potatoes",
          "1/8 teaspoon cayenne",
          "Salt and freshly ground black pepper",
          "An egg wash made by beating lightly 2 large eggs with 1 tablespoon water",
          "1 1/2 cups fine fresh bread crumbs",
          "Oil, for frying"
        ],
        "title": "Chicken and Sweet-Potato Croquettes",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Process garlic in food processor to finely chop. Heat a large skillet over medium high heat. Add oil and butter. Add garlic and crushed pepper flakes to oil and butter. Season shrimp with salt and toss to coat. Add shrimp to the pan and cook, stirring frequently, until pink and heads curl to tails. Add black pepper, to your taste. Serve immediately.",
        "ingredients": [
          "12 to 15 cloves garlic, cracked away from skins",
          "2 tablespoons extra-virgin olive oil, 3 turns of the pan",
          "2 tablespoons butter, cut in small pieces",
          "1/2 to 1 teaspoon crushed red pepper flakes",
          "1 1/2 pounds, 30 pieces, jumbo shrimp, peeled and deveined, ask for easy peel shrimps",
          "1 teaspoon coarse salt",
          "Black pepper",
          "1 toothpick, optional"
        ],
        "title": "Garlic Lovers Shrimp",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "In a mixing bowl break the tuna up with a fork. Toss with the onion, fresh coriander, and raisins. In a small saute pan, heat the oil over medium heat, add the curry powder, and stir until fragrant, about 30 seconds. Remove pan from the heat and set oil aside to cool. Add the curry oil to the mayonnaise, season with salt, and pepper to taste and add the lime juice. Gently mix the tuna with the seasoned mayonnaise. Serve on a bed of lettuce or in a sandwich. Yield: 3 to 4 servings\nCopyright 2001 Television Food Network, G.P. All rights reserved.",
        "ingredients": [
          "Two 6 ounce cans white meat tuna packed in water, drained",
          "3 tablespoons minced red onion, soaked in cold water for 5 minutes, drained",
          "1 tablespoon finely chopped fresh coriander (cilantro)",
          "1 tablespoon golden raisins, plumped in 2 tablespoons warm water for 10 minutes, drained",
          "2 teaspoons vegetable oil, like soy, peanut, or corn",
          "2 teaspoons Madras-style curry powder",
          "6 tablespoons mayonnaise",
          "Kosher salt and freshly ground black pepper",
          "1/2 teaspoon freshly squeezed lime juice plus more to taste",
          "Serving suggestions: 2 cups mixed lettuces or 3 to 4 pita bread"
        ],
        "title": "Curried Tuna Salad",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Cook the mussels: Heat a skillet large enough to hold the mussels in a single layer over high heat for 1 minute. Remove from the heat and add the mussels and 1/4 cup of the vermouth. Return the skillet to the stove and cook for 1 minute. Add about 3/4 cup water. The mussels shouldn't take long to cook, about 2 minutes. Take care to stir the mussels from time to time so they cook as evenly as possible. Use tongs to pluck the mussels from the pan as they open. When all of the mussels are open, remove them and strain the liquid, reserving it for the sauce. Remove the mussels from their shells. Discard the shells.\nCook the mushrooms: Rinse the skillet and return it to high heat until it smokes lightly. Remove the pan from the heat, add 1 tablespoon of the butter, and swirl the pan until the butter turns a light brown color. Return the skillet to the heat and immediately add the shallots and mushrooms. Season lightly with salt and the red pepper flakes. Cook the mushrooms until they start to give up liquid and brown, 3 to 4 minutes. Add the remaining 1/4 cup vermouth and cook for 1 minute. Season to taste with salt. Toast the hazelnuts: Meanwhile, in a small skillet, melt 1 tablespoon of the butter over medium heat and add the hazelnuts. Season them lightly with salt and toast them over low heat until they turn light brown, 5 to 7 minutes. Use a slotted spoon to remove the hazelnuts and transfer them to a cutting board. Roughly chop the hazelnuts.\nMake the sauce: Transfer the mushrooms to a plate using a slotted spoon. If there is any cooking liquid from the mushrooms, combine it with the mussel cooking liquid in a small saucepan. Simmer over low heat for 1 minute. The sauce may need a pinch of salt. The flavor should be an initial taste of sweet mussel followed by an undertone of earthiness from the mushroom. Swirl in 1 tablespoon of the butter and a touch of lemon juice. Keep warm.\nAssemble the dish: Heat a large skillet over high heat until hot, 2 minutes. Remove from the heat and add the remaining 1 tablespoon butter. When it turns light brown, return the skillet to the burner and add the mussels and mushrooms in a single layer. Cook for 1 minute without stirring them. They should be browned on their first side before you stir them slightly, with a wooden spoon, and leave them to brown for an additional minute. Stir in the sauce. Taste for seasoning. Toss in the hazelnuts. Serve immediately on a platter, family style, with slices of grilled bread.",
        "ingredients": [
          "1 1/2 pounds mussels, scrubbed and debearded",
          "1/2 cup dry vermouth, preferably Noilly Prat",
          "4 tablespoons (1/2 stick) unsalted butter",
          "2 medium shallots, thinly sliced",
          "3/4 pound white button mushrooms, ends trimmed, wiped clean and quartered",
          "Kosher salt",
          "1/4 teaspoon red pepper flakes",
          "2 tablespoons blanched whole hazelnuts",
          "Juice of 1 to 2 lemons, to taste",
          "Grilled bread"
        ],
        "title": "Mussels with White Mushrooms and Hazelnuts",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "For Meatballs\nPreheat oven to 400 degrees F.\nIn a large bowl combine the milk and bread. Let the bread absorb the milk. Add remaining meatball ingredients except the cheese. Using your hands, gently combine all the ingredients until they are thoroughly mixed. Take about 3 tablespoons of the meat mixture and roll into a ball and press into a patty. Place a mozzarella cube or 1 tablespoon shredded cheese onto the patty and bring up the sides around the cheese and roll between hands to form a ball. Place onto a nonstick baking sheet or a baking sheet sprayed with nonstick cooking spray. Repeat process with remaining meat and cheese. Place the meatballs into the oven and cook for 12 minutes. Remove baking sheet from the oven and set aside.\nFor Sauce:\nIn a medium pot heat olive oil over medium heat. Add onion, garlic and saute for 3 minutes. Add remaining ingredients and simmer for 10 minutes. Gently stir in the meatballs and any pan drippings from baking sheet and simmer for another 5 minutes.\nSpaghetti:\nCook the spaghetti in a large pot of boiling salted water until al dente, about 8 minutes. Drain and place the pasta on a large serving platter. Place the meatballs over the spaghetti, pour the sauce on top and serve immediately.",
        "ingredients": [
          "1/4 cup milk",
          "2 slice white bread, cut into cubes",
          "1 pound 80 percent lean ground beef",
          "1/2 medium onion, diced",
          "1 egg",
          "1 tablespoon chopped garlic",
          "1 tablespoon Italian seasoning",
          "1/2 teaspoon salt",
          "1/4 teaspoon ground black pepper",
          "2 sticks mozzarella string cheese, cut into small cubes or 1/2 cup shredded mozzarella",
          "Nonstick cooking spray",
          "2 tablespoons olive oil",
          "1/2 medium onion diced",
          "1 tablespoon chopped garlic",
          "1 (28-ounce) can diced tomatoes",
          "2 tablespoons freshly chopped basil leaves",
          "2 tablespoons freshly chopped parsley leaves",
          "Salt and freshly ground black pepper",
          "1 (16-ounce) box spaghetti"
        ],
        "title": "Spaghetti with Meatballs",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Blend the peas and vegetable broth in a blender until smooth. Take the lid off and, with the motor running, pour in the oil in a steady stream to emulsify the mixture. Add the lemon juice then chill in the refrigerator for 1 hour.\nTo make the spicy crab, whisk the canola oil, chili paste, and lemon juice together in a bowl. Fold in the crabmeat and mint and season with a pinch of salt. Fill espresso or sake cups, about 3/4 full, with the chilled pea soup. Garnish the pea shots with a generous tablespoon of the spicy crab and serve immediately.",
        "ingredients": [
          "2 cups frozen sweet peas, run under cool water to thaw",
          "1 (14 1/2-ounce) can vegetable broth",
          "1/2 cup canola oil",
          "1/2 lemon, juiced",
          "Sea salt and freshly ground black pepper",
          "3 tablespoons canola oil",
          "1 tablespoon red chili paste, such as Sambal",
          "1/2 lemon, juiced",
          "1 cup fresh lump crab meat, picked through",
          "1/4 bunch fresh mint leaves, chopped",
          "Pinch sea salt"
        ],
        "title": "Chilled Pea Shots with Spicy Crab",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Watch how to make this recipe.\nFor the stock: Remove the skin from the turkey. Remove the meat from the bones, cut the meat into a medium dice and reserve for later use. Place the bones in a large stock pot. Add 3 gallons water, the chicken base and liquid smoke. Simmer for 4 hours then strain through cheesecloth. Cool and then skim off the fat from the top of the liquid.\nFor the soup: Roast the red peppers. Place the peppers under the broiler until the skins become charred. Then place the peppers in a container and cover with a lid. Sweat the peppers until the skin peels off easily. Remove the skin and seeds. Dice the peppers, celery, carrots and onions. Set aside.\nCook the wild rice in 8 cups water for approximately 1 hour.\nTo assemble, melt the butter in large pot. Add the diced carrots, celery and onions. Cook for 5 minutes. Add the flour and cook another 5 minutes. Add the 3 gallons of turkey stock and simmer about 15 minutes. Place in a blender and puree the vegetables. Put the puree back into the pot and add the diced turkey, roasted peppers and rice. Stir in the half-and-half.\nServe while hot.",
        "ingredients": [
          "1 whole smoked turkey",
          "6 ounces chicken base",
          "4 ounces liquid smoke",
          "8 red peppers",
          "4 ribs celery",
          "2 carrots",
          "2 onions",
          "1 pound wild rice",
          "1 1/2 pounds butter",
          "3 1/2 cups all-purpose flour",
          "1 teaspoon white pepper ground",
          "12 cups half-and-half"
        ],
        "title": "Smoked Turkey with Wild Rice",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "instructions": "Preheat oven to 350 degrees F.\nHeat butter in Dutch oven or heavy casserole pan. Season meat with salt and pepper, sprinkle with flour and stir to incorporate. Add the meat to the pot and cook until well browned, about 5 to 7 minutes.\nAdd carrots, celery, onion, and fennel and cook for 5 minutes. Add garlic, herbs, and orange zest and cook for 2 minutes. Add wine and orange juice and reduce by 1/2. Add the stock and bring to a simmer.\nSimmer for 15 minutes then transfer to oven. Cook for 1 1/2 to 2 hours, stirring occasionally. When the meat is very tender and the sauce is thickened, remove, and season with salt and pepper.",
        "ingredients": [
          "3 tablespoons butter",
          "2 pounds beef chuck cubes",
          "Salt and freshly ground black pepper",
          "3 tablespoons flour",
          "2 carrots, peeled and diced",
          "2 stalks celery, diced",
          "1 onion, diced",
          "1 bulb fennel, diced",
          "2 tablespoons garlic, chopped",
          "2 teaspoons herbs de Provence",
          "1 orange, zest and juiced",
          "2 cups red wine",
          "2 cups beef stock"
        ],
        "title": "Provencale Daube of Beef",
        "type": "Dinner",
        "popularity": 0,
        "picture_link": ""
      },
      {
        "ingredients": [
          "6 tablespoons kosher salt",
          "4 tablespoons black peppercorns, medium ground",
          "1 tablespoon granulated sugar",
          "1 tablespoon paprika",
          "1 (12–14-pound) turkey",
          "1 head of garlic, cut in half crosswise",
          "2 sprigs rosemary",
          "Olive oil (for cooking; 5–7 cups)",
          "1/2 cup (packed) light brown sugar",
          "1/2 cup bourbon",
          "2 tablespoons soy sauce",
          "2 tablespoons unsalted butter",
          "1 teaspoon paprika"
        ],
        "type": "Dinner",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Dry brine: Mix salt, pepper, granulated sugar, and paprika in a small bowl. Arrange turkey on a cutting board breast side up. Remove legs (keeping thigh and drumstick intact) by slicing through the skin that joins breast and leg, then bend leg down to expose joint and cut completely through the joint. Try to leave as much skin on breast as possible. Place legs on a large rimmed baking sheet. Set aside neck and giblets in cavity for making gravy. Arrange turkey on baking sheet with legs and generously sprinkle legs and turkey all over with dry brine, patting to adhere. Chill, uncovered, at least 12 hours and up to 2 days.\nMix salt, pepper, granulated sugar, and paprika in a small bowl. Arrange turkey on a cutting board breast side up. Remove legs (keeping thigh and drumstick intact) by slicing through the skin that joins breast and leg, then bend leg down to expose joint and cut completely through the joint. Try to leave as much skin on breast as possible. Place legs on a large rimmed baking sheet. Set aside neck and giblets in cavity for making gravy. Arrange turkey on baking sheet with legs and generously sprinkle legs and turkey all over with dry brine, patting to adhere. Chill, uncovered, at least 12 hours and up to 2 days.\nConfit legs: Wipe off turkey legs (do not rinse) and place in the smallest heavy pot that will accommodate legs in a single layer (it’s okay if they overlap slightly). Add garlic and rosemary. Pour in oil just to barely cover legs. Heat over medium until a few bubbles begin to appear. Cover, reduce heat, and very gently simmer until meat is tender (the meat on the drumstick will have pulled away from the bone), 3–3 1/2 hours. Let turkey thighs cool in oil until just warm, about 2 hours. Chill at least 2 hours but preferably longer. Meat will firm up the colder it gets, making it less likely to fall apart when glazing.\nWipe off turkey legs (do not rinse) and place in the smallest heavy pot that will accommodate legs in a single layer (it’s okay if they overlap slightly). Add garlic and rosemary. Pour in oil just to barely cover legs. Heat over medium until a few bubbles begin to appear. Cover, reduce heat, and very gently simmer until meat is tender (the meat on the drumstick will have pulled away from the bone), 3–3 1/2 hours. Let turkey thighs cool in oil until just warm, about 2 hours. Chill at least 2 hours but preferably longer. Meat will firm up the colder it gets, making it less likely to fall apart when glazing.\nBreast and assembly: Preheat oven to 425°F. Place turkey on a wire rack set inside a large rimmed baking sheet. Roast, rotating baking sheet once, until golden brown all over, 35–40 minutes. Meanwhile, bring brown sugar, bourbon, soy sauce, butter, and paprika to a simmer in a small saucepan over medium heat, stirring occasionally, until reduced by about half and thick enough to coat a spoon but not syrupy, 6–8 minutes. Reduce heat to very low and keep glaze warm until ready to use. Reduce oven temperature to 325°F and roast turkey until an instant-read thermometer inserted into the thickest part of breast registers 100°F–110°F. Then roast, basting every 10 minutes or so, making sure to lightly coat the entire breast each time (but save some glaze for the legs) and rotating baking sheet occasionally, until thermometer registers 150°F, 60–75 minutes total after reducing oven temperature to 325°F. Transfer breast to a cutting board and let rest at least 30 minutes before carving. Increase oven temperature back to 425°F. Remove turkey legs from oil, wiping off excess, and place on a clean rimmed baking sheet; discard or chill cooking oil (skim off juices and use them in gravy; use oil for cassoulet or another confit). Carefully move a rack to upper third of oven and roast legs until skin is golden brown and fat is rendered, 15–20 minutes. Then roast, basting every 3 minutes or so with remaining glaze, until legs are well coated, 10–12 minutes. Arrange on a platter with sliced breast for serving.\nPreheat oven to 425°F. Place turkey on a wire rack set inside a large rimmed baking sheet. Roast, rotating baking sheet once, until golden brown all over, 35–40 minutes.\nMeanwhile, bring brown sugar, bourbon, soy sauce, butter, and paprika to a simmer in a small saucepan over medium heat, stirring occasionally, until reduced by about half and thick enough to coat a spoon but not syrupy, 6–8 minutes. Reduce heat to very low and keep glaze warm until ready to use.\nReduce oven temperature to 325°F and roast turkey until an instant-read thermometer inserted into the thickest part of breast registers 100°F–110°F. Then roast, basting every 10 minutes or so, making sure to lightly coat the entire breast each time (but save some glaze for the legs) and rotating baking sheet occasionally, until thermometer registers 150°F, 60–75 minutes total after reducing oven temperature to 325°F. Transfer breast to a cutting board and let rest at least 30 minutes before carving.\nIncrease oven temperature back to 425°F. Remove turkey legs from oil, wiping off excess, and place on a clean rimmed baking sheet; discard or chill cooking oil (skim off juices and use them in gravy; use oil for cassoulet or another confit).\nCarefully move a rack to upper third of oven and roast legs until skin is golden brown and fat is rendered, 15–20 minutes. Then roast, basting every 3 minutes or so with remaining glaze, until legs are well coated, 10–12 minutes. Arrange on a platter with sliced breast for serving.\nDo Ahead Legs can be cooked 1 day ahead. Keep chilled in oil.\nLegs can be cooked 1 day ahead. Keep chilled in oil.",
        "title": "Bourbon and Brown Sugar Glazed Turkey "
      },
      {
        "ingredients": [
          "1/2 cup pearl barley",
          "1 1/2 cups canned vegetable broth",
          "1 large poblano chili or green bell pepper",
          "1 small red bell pepper",
          "2 large plum tomatoes, seeded, chopped (about 1 cup)",
          "1 cup fresh corn kernels",
          "1/3 cup chopped fresh cilantro",
          "1/4 cup chopped green onions",
          "2 1/2 tablespoons fresh lime juice",
          "2 tablespoons olive oil",
          "Nonstick olive oil spray",
          "4 large portobello mushrooms, stemmed, dark gills scraped away",
          "24 large spinach leaves"
        ],
        "type": "Dinner",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Place barley in heavy large saucepan. Cook over medium heat until pale golden, shaking pan occasionally, about 10 minutes. Add broth to pan and bring to boil. Reduce heat to medium-low, cover and simmer until barley is tender and broth is absorbed, about 35 minutes. Uncover and let barley cool. Char poblano and red bell pepper over gas flame or in broiler until blackened on all sides. Enclose in paper bag and let stand 10 minutes. Peel, seed and dice poblano and red bell pepper. Place barley, poblano and red bell pepper in large bowl. Add tomatoes and next 5 ingredients; toss to blend. Season salad with salt and pepper. (Can be prepared 1 day ahead. Cover; refrigerate. Bring to room temperature before serving.) Prepare barbecue (medium-high heat). Spray mushrooms with nonstick spray; sprinkle with salt and pepper. Grill until cooked through, about 4 minutes per side. Transfer to work surface; slice thinly. Arrange 6 spinach leaves on each of 4 plates. Top with barley salad. Arrange 1 sliced mushroom alongside each salad. Serve while mushrooms are still warm.\nPlace barley in heavy large saucepan. Cook over medium heat until pale golden, shaking pan occasionally, about 10 minutes. Add broth to pan and bring to boil. Reduce heat to medium-low, cover and simmer until barley is tender and broth is absorbed, about 35 minutes. Uncover and let barley cool.\nChar poblano and red bell pepper over gas flame or in broiler until blackened on all sides. Enclose in paper bag and let stand 10 minutes. Peel, seed and dice poblano and red bell pepper.\nPlace barley, poblano and red bell pepper in large bowl. Add tomatoes and next 5 ingredients; toss to blend. Season salad with salt and pepper. (Can be prepared 1 day ahead. Cover; refrigerate. Bring to room temperature before serving.)\nPrepare barbecue (medium-high heat). Spray mushrooms with nonstick spray; sprinkle with salt and pepper. Grill until cooked through, about 4 minutes per side. Transfer to work surface; slice thinly.\nArrange 6 spinach leaves on each of 4 plates. Top with barley salad. Arrange 1 sliced mushroom alongside each salad. Serve while mushrooms are still warm.",
        "title": "Toasted Barley Salad with Red Bell Pepper, Corn and Grilled Portobello Mushrooms "
      },
      {
        "ingredients": [
          "1 (2- to 2 1/2-pound) kabocha squash",
          "2 tablespoons olive oil",
          "1/4 cup honey",
          "1 tablespoon fresh ginger, finely grated",
          "1/2 teaspoon kosher salt"
        ],
        "type": "Dinner",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Bring 8-quart pot of water to boil. Add squash and boil, uncovered, 2 1/2 minutes. Using tongs, flip squash over, then boil 2 1/2 minutes more. Drain and let cool. When squash is cool enough to handle, cut off top and bottom and remove skin with paring knife. Cut squash in half crosswise, scoop out seeds, and cut flesh into 1-inch chunks. In medium bowl, stir together squash, olive oil, honey, ginger, and salt. Transfer to steamer set over boiling water and steam until tender, about 15 minutes. Spoon onto large plate and serve.\nBring 8-quart pot of water to boil. Add squash and boil, uncovered, 2 1/2 minutes. Using tongs, flip squash over, then boil 2 1/2 minutes more. Drain and let cool.\nWhen squash is cool enough to handle, cut off top and bottom and remove skin with paring knife. Cut squash in half crosswise, scoop out seeds, and cut flesh into 1-inch chunks.\nIn medium bowl, stir together squash, olive oil, honey, ginger, and salt. Transfer to steamer set over boiling water and steam until tender, about 15 minutes. Spoon onto large plate and serve.",
        "title": "Steamed Kabocha Squash "
      },
      {
        "ingredients": [
          "12 (1/2-inch-thick) slices brioche or firm white sandwich bread, crusts discarded",
          "16 jumbo shrimp, peeled, leaving tail fan attached, and deveined",
          "3/4 stick unsalted butter, softened",
          "2 tablespoons finely chopped dill",
          "1 tablespoon finely chopped shallot",
          "Equipment: 8 (2-ounce) ramekins or small ovenproof cups"
        ],
        "type": "Dinner",
        "popularity": 0,
        "picture_link": "",
        "instructions": "Preheat oven to 375°F with rack in middle. Cut bread into 24 (2- by 1-inch) rectangles, then bake in a 4-sided sheet pan, turning once or twice, until golden, 8 to 10 minutes. (Leave oven on.) Transfer to a rack to cool. Season shrimp with 1/4 teaspoon salt and 1/8 teaspoon pepper. Mash together butter, dill, shallot, and 1/4 teaspoon each of salt and pepper. Put a dab of dill butter in each ramekin, then put ramekins in sheet pan. Arrange 2 shrimp, with tails up and facing each other, in each ramekin. Spread remaining dill butter in ramekins and bake until shrimp are just cooked through, 20 to 25 minutes. Serve with toasts.\nPreheat oven to 375°F with rack in middle.\nCut bread into 24 (2- by 1-inch) rectangles, then bake in a 4-sided sheet pan, turning once or twice, until golden, 8 to 10 minutes. (Leave oven on.) Transfer to a rack to cool.\nSeason shrimp with 1/4 teaspoon salt and 1/8 teaspoon pepper. Mash together butter, dill, shallot, and 1/4 teaspoon each of salt and pepper. Put a dab of dill butter in each ramekin, then put ramekins in sheet pan. Arrange 2 shrimp, with tails up and facing each other, in each ramekin. Spread remaining dill butter in ramekins and bake until shrimp are just cooked through, 20 to 25 minutes. Serve with toasts.",
        "title": "Shrimp in Dill Butter "
      }
    ]
  }
